Netzpfuscher/VESC_GD32/STM32CubeIDE/Application/User/VESC/src/conf_general.c
		for (int i = 0;i < 10000;i++) {
			vq_avg += mcpwm_foc_get_vq();
			vd_avg += mcpwm_foc_get_vd();
			iq_avg += mcpwm_foc_get_iq();
			id_avg += mcpwm_foc_get_id();
			samples2 += 1.0;
			for (uint32_t i = 0; i < 1000; i++) {
				__asm__ __volatile__ ("" : "+g" (i) : :);
			}

			fault = mc_interface_get_fault();
			if (fault != FAULT_CODE_NONE) {
				break;
			}
		}

		vq_avg /= samples2;
		vd_avg /= samples2;
		iq_avg /= samples2;
		id_avg /= samples2;

		float rad_s = RPM2RADPS_f(rpm_now);
		float v_mag = NORM2_f(vq_avg, vd_avg);
		float i_mag = NORM2_f(iq_avg, id_avg);
		*linkage = (v_mag - res * i_mag) / rad_s - i_mag * ind;

		mcconf->foc_motor_r = res;
		mcconf->foc_motor_l = ind;
		mcconf->foc_motor_flux_linkage = *linkage;
		mcconf->foc_observer_gain = 0.5e3 / SQ(*linkage);
		mc_interface_set_configuration(mcconf);

		// Give the observer time to settle
		chThdSleepMilliseconds(500);

		// Turn off the FETs
		mcpwm_foc_stop_pwm(false);

		// Clear any lingering current set points
		mcpwm_foc_set_current(0.0);

		// Let the H-bridges settle
		chThdSleepMilliseconds(5);

		float linkage_sum = 0.0;
		float linkage_samples = 0.0;
		if (fault == FAULT_CODE_NONE) {
			for (int i = 0;i < 2000;i++) {
				float rad_s_now = RPM2RADPS_f(mcpwm_foc_get_rpm_faster());
				if (fabsf(mcpwm_foc_get_duty_cycle_now()) < 0.02) {
					break;
				}

				linkage_sum += mcpwm_foc_get_vq() / rad_s_now;

				// Optionally use magnitude
//              linkage_sum += sqrtf(SQ(mcpwm_foc_get_vq()) + SQ(mcpwm_foc_get_vd())) / rad_s_now;

				// Optionally use magnitude of observer state
//              float x1, x2;
//              mcpwm_foc_get_observer_state(&x1, &x2);
//              linkage_sum += sqrtf(SQ(x1) + SQ(x2));

				linkage_samples += 1.0;
				for (uint32_t i = 0; i < 1000; i++) {
					__asm__ __volatile__ ("" : "+g" (i) : :);
				}

				fault = mc_interface_get_fault();
				if (fault != FAULT_CODE_NONE) {
					break;
				}
			}

			*undriven_samples = linkage_samples;

			if (linkage_samples > 0) {
				*linkage_undriven = linkage_sum / linkage_samples;
			} else {
				*linkage_undriven = 0.0;
			}
			if (*linkage > 0.0) {
				*result = true;
			}
		}
	}

	// Some functions use 0 to detect a failure
	if (fault != FAULT_CODE_NONE) {
		*linkage_undriven = 0.0;
		*linkage = 0.0;
	}

	timeout_configure(tout, tout_c, tout_ksw);
	mc_interface_unlock();
	mc_interface_release_motor();
	mc_interface_wait_for_motor_release(1.0);
	mc_interface_set_configuration(mcconf_old);
	mempools_free_mcconf(mcconf);
	mempools_free_mcconf(mcconf_old);
	return fault;
}

/**
 * Detect and apply all parameters, current limits and sensors. This is done for
 * both motors on dual controllers.
 *
 * @param max_power_loss
 * The maximum power loss to derive current limits, as well as detection currents, from.
 *
 * @param store_mcconf_on_success
 * Store motor configuration in emulated EEPROM if the detection succeeds.
 *
 * @param send_mcconf_on_success
 * Send motor configuration if the detection succeeds.
 *
 * @return
 * >=0: Success, see conf_general_autodetect_apply_sensors_foc codes
 * -10: Flux linkage detection failed
 *  -x: see conf_general_autodetect_apply_sensors_foc faults
 *  -100 + fault: Fault code that occured during detection see "mc_fault_code"
 */
int conf_general_detect_apply_all_foc(float max_power_loss,
									  bool store_mcconf_on_success, bool send_mcconf_on_success) {
	int result = -1;

	int faultM1 = FAULT_CODE_NONE;
	int faultM2 = FAULT_CODE_NONE;

	int motor_last = mc_interface_get_motor_thread();
	mc_interface_select_motor_thread(1);

	mc_configuration *mcconf = mempools_alloc_mcconf();
	mc_configuration *mcconf_old = mempools_alloc_mcconf();

	*mcconf = *mc_interface_get_configuration();
	*mcconf_old = *mcconf;

#ifdef HW_HAS_DUAL_MOTORS
	mc_interface_select_motor_thread(2);
	mc_configuration *mcconf_second = mempools_alloc_mcconf();
	mc_configuration *mcconf_old_second = mempools_alloc_mcconf();
	*mcconf_second = *mc_interface_get_configuration();
	*mcconf_old_second = *mcconf_second;
	mc_interface_select_motor_thread(1);
#endif

	mcconf->motor_type = MOTOR_TYPE_FOC;
	mcconf->foc_sensor_mode = FOC_SENSOR_MODE_SENSORLESS;
	mcconf->foc_f_zv = 10000.0; // Lower f_zv => less dead-time distortion
	mcconf->foc_current_kp = 0.0005;
	mcconf->foc_current_ki = 1.0;
	mcconf->l_current_max = MCCONF_L_CURRENT_MAX;
	mcconf->l_current_min = MCCONF_L_CURRENT_MIN;
	mcconf->l_abs_current_max = MCCONF_L_MAX_ABS_CURRENT;
	mcconf->l_current_max_scale = MCCONF_L_CURRENT_MAX_SCALE;
	mcconf->l_current_min_scale = MCCONF_L_CURRENT_MIN_SCALE;
	mcconf->l_watt_max = MCCONF_L_WATT_MAX;
	mcconf->l_watt_min = MCCONF_L_WATT_MIN;
	mcconf->l_max_erpm = MCCONF_L_RPM_MAX;
	mcconf->l_min_erpm = MCCONF_L_RPM_MIN;
	mc_interface_set_configuration(mcconf);

#ifdef HW_HAS_DUAL_MOTORS
	mcconf_second->motor_type = MOTOR_TYPE_FOC;
	mcconf_second->foc_sensor_mode = FOC_SENSOR_MODE_SENSORLESS;
	mcconf_second->foc_f_zv = 10000.0; // Lower f_zv => less dead-time distortion
	mcconf_second->foc_current_kp = 0.0005;
	mcconf_second->foc_current_ki = 1.0;
	mcconf_second->l_current_max = MCCONF_L_CURRENT_MAX;
	mcconf_second->l_current_min = MCCONF_L_CURRENT_MIN;
	mcconf_second->l_abs_current_max = MCCONF_L_MAX_ABS_CURRENT;
	mcconf_second->l_current_max_scale = MCCONF_L_CURRENT_MAX_SCALE;
	mcconf_second->l_current_min_scale = MCCONF_L_CURRENT_MIN_SCALE;
	mcconf_second->l_watt_max = MCCONF_L_WATT_MAX;
	mcconf_second->l_watt_min = MCCONF_L_WATT_MIN;
	mcconf_second->l_max_erpm = MCCONF_L_RPM_MAX;
	mcconf_second->l_min_erpm = MCCONF_L_RPM_MIN;

	mc_interface_select_motor_thread(2);
	mc_interface_set_configuration(mcconf_second);
	mc_interface_select_motor_thread(1);
#endif

	// Wait maximum 5s for fault code to disappear
	if (!wait_fault(5000)) {
		mc_interface_set_configuration(mcconf_old);
		mempools_free_mcconf(mcconf);
		mempools_free_mcconf(mcconf_old);
#ifdef HW_HAS_DUAL_MOTORS
		mc_interface_select_motor_thread(2);
		mc_interface_set_configuration(mcconf_old_second);
		mc_interface_select_motor_thread(1);
		mempools_free_mcconf(mcconf_second);
		mempools_free_mcconf(mcconf_old_second);
#endif
		mc_interface_select_motor_thread(motor_last);
		return mc_interface_get_fault() - 100; // Offset fault by -100
	}

