Netzpfuscher/VESC_GD32/STM32CubeIDE/Application/User/VESC/src/conf_general.c
	// Wait one second for things to get ready after
	// the fault disappears.
	chThdSleepMilliseconds(1000);

	// Disable timeout
	systime_t tout = timeout_get_timeout_msec();
	float tout_c = timeout_get_brake_current();
	KILL_SW_MODE tout_ksw = timeout_get_kill_sw_mode();
	timeout_reset();
	timeout_configure(60000, 0.0, KILL_SW_MODE_DISABLED);

	mc_interface_lock();

#ifdef HW_HAS_DUAL_MOTORS
	mc_interface_select_motor_thread(2);
	mc_interface_lock();
	mc_interface_select_motor_thread(1);
#endif

#ifdef HW_HAS_DUAL_MOTORS
	measure_r_l_imax_arg_t r_l_imax_args;
	r_l_imax_args.current_min = mcconf->cc_min_current;
	r_l_imax_args.current_max = mcconf->l_current_max;
	r_l_imax_args.max_power_loss = max_power_loss;
	r_l_imax_args.motor = 2;
	worker_execute(measure_r_l_imax_task, &r_l_imax_args);
#endif

	float r = 0.0;
	float l = 0.0;
	float ld_lq_diff;
	float i_max = 0.0;
	faultM1 = measure_r_l_imax(mcconf->cc_min_current,
							   mcconf->l_current_max, max_power_loss, &r, &l, &ld_lq_diff, &i_max);

#ifdef HW_HAS_DUAL_MOTORS
	worker_wait();
	faultM2 = r_l_imax_args.fault;
#endif

	if (faultM1 != FAULT_CODE_NONE || faultM2 != FAULT_CODE_NONE) {
		timeout_configure(tout, tout_c, tout_ksw);
		mc_interface_unlock();
		mc_interface_release_motor();
		mc_interface_wait_for_motor_release(1.0);
		mc_interface_set_configuration(mcconf_old);
		mempools_free_mcconf(mcconf);
		mempools_free_mcconf(mcconf_old);
#ifdef HW_HAS_DUAL_MOTORS
		mc_interface_select_motor_thread(2);
		mc_interface_set_configuration(mcconf_old_second);
		mc_interface_select_motor_thread(1);
		mempools_free_mcconf(mcconf_second);
		mempools_free_mcconf(mcconf_old_second);
#endif
		mc_interface_select_motor_thread(motor_last);
		if(faultM1 != FAULT_CODE_NONE) {
			return faultM1 - 100; // Offset fault codes by -100 to leave room for extra fault codes to be added later.
		} else {
			return faultM2 - 100;
		}
	}

	// Increase switching frequency for flux linkage measurement
	// as dead-time distortion has less effect at higher modulation.
	// Having a smooth rotation is more important.
#ifdef HW_HAS_DUAL_MOTORS
	mcconf->foc_f_zv = 25000.0;
#else
	mcconf->foc_f_zv = 40000.0;
#endif
	mc_interface_set_configuration(mcconf);

#ifdef HW_HAS_DUAL_MOTORS
	mc_interface_select_motor_thread(2);
	mcconf_second->foc_f_zv = 25000.0; // TODO: Is 40khz here actually OK?
	mc_interface_set_configuration(mcconf_second);
	mc_interface_select_motor_thread(1);
#endif

#ifdef HW_HAS_DUAL_MOTORS
	measure_flux_linkage_arg_t linkage_args;
	linkage_args.current = r_l_imax_args.i_max / 2.5;
	linkage_args.duty = 0.3;
	linkage_args.erpm_per_sec = 1800;
	linkage_args.res = r_l_imax_args.r;
	linkage_args.ind = r_l_imax_args.l;
	linkage_args.motor = 2;
	worker_execute(measure_flux_linkage_task, &linkage_args);
#endif

	float lambda = 0.0;
	float lambda_undriven = 0.0;
	float lambda_undriven_samples = 0.0;
	bool res;
	faultM1 = conf_general_measure_flux_linkage_openloop(i_max / 2.5, 0.3, 1800, r, l,
														 &lambda, &lambda_undriven, &lambda_undriven_samples, &res);

	if (lambda_undriven_samples > 60) {
		lambda = lambda_undriven;
		if (lambda <= 0.0){
			res = false;
		}
	}

	res = true;

#ifdef HW_HAS_DUAL_MOTORS
	worker_wait();
	faultM2 = linkage_args.fault;
	bool res_linkage_m2 = linkage_args.result;
#else
	bool res_linkage_m2 = true;
#endif

	if (faultM1 != FAULT_CODE_NONE || faultM2 != FAULT_CODE_NONE) {
		timeout_configure(tout, tout_c, tout_ksw);
		mc_interface_unlock();
		mc_interface_release_motor();
		mc_interface_wait_for_motor_release(1.0);
		mc_interface_set_configuration(mcconf_old);
		mempools_free_mcconf(mcconf);
		mempools_free_mcconf(mcconf_old);
#ifdef HW_HAS_DUAL_MOTORS
		mc_interface_select_motor_thread(2);
		mc_interface_set_configuration(mcconf_old_second);
		mc_interface_select_motor_thread(1);
		mempools_free_mcconf(mcconf_second);
		mempools_free_mcconf(mcconf_old_second);
#endif
		mc_interface_select_motor_thread(motor_last);
		if(faultM1 != FAULT_CODE_NONE) {
			return faultM1 - 100; // Offset fault codes by -100 to leave room for extra fault codes to be added later.
		} else {
			return faultM2 - 100;
		}
	}

	if (res && res_linkage_m2) {
		mcconf_old->l_current_max = i_max;
		mcconf_old->l_current_min = -i_max;
		float abs_max = i_max * 1.5;
		utils_truncate_number(&abs_max, HW_LIM_CURRENT_ABS);
		mcconf_old->l_abs_current_max = abs_max;
		mcconf_old->motor_type = MOTOR_TYPE_FOC;
		mcconf_old->foc_motor_r = r;
		mcconf_old->foc_motor_l = l;
		mcconf_old->foc_motor_ld_lq_diff = ld_lq_diff;
		mcconf_old->foc_motor_flux_linkage = lambda;

		if (mc_interface_temp_motor_filtered() > -10) {
			mcconf_old->foc_temp_comp_base_temp = mc_interface_temp_motor_filtered();
#ifdef HW_HAS_PHASE_FILTERS
			mcconf_old->foc_temp_comp = true;
#endif
		}

		conf_general_calc_apply_foc_cc_kp_ki_gain(mcconf_old, 1000);
		mc_interface_set_configuration(mcconf_old);

#ifdef HW_HAS_DUAL_MOTORS
		mcconf_old_second->l_current_max = r_l_imax_args.i_max;
		mcconf_old_second->l_current_min = -r_l_imax_args.i_max;
		abs_max = r_l_imax_args.i_max * 1.5;
		utils_truncate_number(&abs_max, HW_LIM_CURRENT_ABS);
		mcconf_old_second->l_abs_current_max = abs_max;
		mcconf_old_second->motor_type = MOTOR_TYPE_FOC;
		mcconf_old_second->foc_motor_r = r_l_imax_args.r;
		mcconf_old_second->foc_motor_l = r_l_imax_args.l;
		mcconf_old_second->foc_motor_ld_lq_diff = r_l_imax_args.ld_lq_diff;
		mcconf_old_second->foc_motor_flux_linkage = linkage_args.linkage;
		conf_general_calc_apply_foc_cc_kp_ki_gain(mcconf_old_second, 1000);
		mc_interface_select_motor_thread(2);

		if (mc_interface_temp_motor_filtered() > -10) {
			mcconf_old_second->foc_temp_comp_base_temp = mc_interface_temp_motor_filtered();
#ifdef HW_HAS_PHASE_FILTERS
			mcconf_old_second->foc_temp_comp = true;
#endif
		}

		mc_interface_set_configuration(mcconf_old_second);
		mc_interface_select_motor_thread(1);
#endif

		wait_motor_stop(10000);

#ifdef HW_HAS_DUAL_MOTORS
		detect_sensors_arg_t sensors_args;
		sensors_args.current = r_l_imax_args.i_max / 3.0;
		sensors_args.store_mcconf_on_success = store_mcconf_on_success;
		sensors_args.send_mcconf_on_success = send_mcconf_on_success;
		sensors_args.motor = 2;
		worker_execute(detect_sensors_task, &sensors_args);
#endif

