Netzpfuscher/VESC_GD32/STM32CubeIDE/Application/User/VESC/src/conf_general.c
		// This will also store the settings to emulated eeprom and send them to vesc tool
		faultM1 = conf_general_autodetect_apply_sensors_foc(i_max / 3.0,
															store_mcconf_on_success, send_mcconf_on_success, &result);

#ifdef HW_HAS_DUAL_MOTORS
		worker_wait();
		int res_sensors_m2 = sensors_args.res;
		faultM2 = sensors_args.fault;
#else
		int res_sensors_m2 = 0;
#endif

		if (res_sensors_m2 < 0) {
			result = res_sensors_m2;
		}

		if (faultM1 != FAULT_CODE_NONE || faultM2 != FAULT_CODE_NONE) {
			timeout_configure(tout, tout_c, tout_ksw);
			mc_interface_unlock();
			mc_interface_release_motor();
			mc_interface_wait_for_motor_release(1.0);
			mc_interface_set_configuration(mcconf_old);
			mempools_free_mcconf(mcconf);
			mempools_free_mcconf(mcconf_old);
#ifdef HW_HAS_DUAL_MOTORS
			mc_interface_select_motor_thread(2);
			mc_interface_set_configuration(mcconf_old_second);
			mc_interface_select_motor_thread(1);
			mempools_free_mcconf(mcconf_second);
			mempools_free_mcconf(mcconf_old_second);
#endif
			mc_interface_select_motor_thread(motor_last);
			if(faultM1 != FAULT_CODE_NONE) {
				return faultM1 - 100; // Offset fault codes by -100 to leave room for extra fault codes to be added later.
			} else {
				return faultM2 - 100;
			}
		}
	} else {
		result = -10;
	}

	timeout_configure(tout, tout_c, tout_ksw);
	mc_interface_lock_override_once();
	mc_interface_release_motor();
	mc_interface_wait_for_motor_release(1.0);
	mc_interface_unlock();

	if (result < 0) {
		mc_interface_set_configuration(mcconf_old);
	}

#ifdef HW_HAS_DUAL_MOTORS
	mc_interface_select_motor_thread(2);
	if (result < 0) {
		mc_interface_set_configuration(mcconf_old_second);
	}
	mc_interface_select_motor_thread(1);
#endif

	mempools_free_mcconf(mcconf);
	mempools_free_mcconf(mcconf_old);
#ifdef HW_HAS_DUAL_MOTORS
	mempools_free_mcconf(mcconf_second);
	mempools_free_mcconf(mcconf_old_second);
#endif

	mc_interface_select_motor_thread(motor_last);

	return result;
}

/**
 * Same as conf_general_detect_apply_all_foc, but also start detection on VESCs found on the CAN-bus.
 *
 * @param detect_can
 * Run detection on VESCs found on the CAN-bus as well. Setting this to false makes
 * this function behave like conf_general_detect_apply_all_foc, with the convenience
 * of also applying the settings.
 *
 * @param max_power_loss
 * The maximum power loss to derive current limits, as well as detection currents, from.
 *
 * @param min_current_in
 * Minimum input current (negative value). 0 means leave it unchanged.
 *
 * @param max_current_in
 * MAximum input current. 0 means leave it unchanged.
 *
 * @param openloop_rpm
 * FOC openloop ERPM in sensorless mode. 0 means leave it unchanged.
 *
 * @param sl_erpm
 * FOC ERPM above which sensorless should be used in sensored modes. 0 means leave it unchanged.
 *
 * @return
 * Same as conf_general_detect_apply_all_foc, and
 * -50: CAN detection timed out
 * -51: CAN detection failed
 */
int conf_general_detect_apply_all_foc_can(bool detect_can, float max_power_loss,
		float min_current_in, float max_current_in, float openloop_rpm, float sl_erpm, PACKET_STATE_t * phandle) {

	int motor_last = mc_interface_get_motor_thread();
	mc_interface_select_motor_thread(1);

	mc_configuration *mcconf = mempools_alloc_mcconf();
	*mcconf = *mc_interface_get_configuration();


	if (fabsf(min_current_in) > 0.001) {
		mcconf->l_in_current_min = min_current_in;
	} else {
		mcconf->l_in_current_min = MCCONF_L_IN_CURRENT_MIN;
	}

	if (fabsf(max_current_in) > 0.001) {
		mcconf->l_in_current_max = max_current_in;
	} else {
		mcconf->l_in_current_max = MCCONF_L_IN_CURRENT_MAX;
	}

	if (fabsf(openloop_rpm) > 0.001) {
		mcconf->foc_openloop_rpm = openloop_rpm;
	} else {
		mcconf->foc_openloop_rpm = MCCONF_FOC_OPENLOOP_RPM;
	}

	if (fabsf(sl_erpm) > 0.001) {
		mcconf->foc_sl_erpm = sl_erpm;
	} else {
		mcconf->foc_sl_erpm = MCCONF_FOC_SL_ERPM;
	}

	mc_interface_set_configuration(mcconf);


	int res = conf_general_detect_apply_all_foc(max_power_loss, false, false);

	// Store and send settings
	if (res >= 0) {

		*mcconf = *mc_interface_get_configuration();
		conf_general_store_mc_configuration(mcconf, mc_interface_get_motor_thread() == 2);

		commands_send_mcconf(COMM_GET_MCCONF, mcconf, phandle);
		vTaskDelay(MS_TO_TICKS(1000));
	}

	mempools_free_mcconf(mcconf);

	mc_interface_select_motor_thread(motor_last);

	return res;
}

extern FLASH_ProcessTypeDef pFlash;
#define FLASH_PAGE_BANK2_SIZE 0x1000
HAL_StatusTypeDef HAL_FLASHEx_EraseGD(FLASH_EraseInitTypeDef *pEraseInit, uint32_t *PageError)
{
  HAL_StatusTypeDef status = HAL_ERROR;
  uint32_t address = 0U;

  /* Process Locked */
  __HAL_LOCK(&pFlash);

/* Check the parameters */
  /* Page Erase requested on address located on bank1 */
  /* Wait for last operation to be completed */
  if (FLASH_WaitForLastOperation((uint32_t)FLASH_TIMEOUT_VALUE) == HAL_OK)
  {
	/*Initialization of PageError variable*/
	*PageError = 0xFFFFFFFFU;

	/* Erase page by page to be done*/
	for(address = pEraseInit->PageAddress;
		address < ((pEraseInit->NbPages * FLASH_PAGE_BANK2_SIZE) + pEraseInit->PageAddress);
		address += FLASH_PAGE_BANK2_SIZE)
	{
	  FLASH_PageErase(address);

	  /* Wait for last operation to be completed */
	  status = FLASH_WaitForLastOperation((uint32_t)FLASH_TIMEOUT_VALUE);

	  /* If the erase operation is completed, disable the PER Bit */
	  CLEAR_BIT(FLASH->CR, FLASH_CR_PER);

	  if (status != HAL_OK)
	  {
		/* In case of error, stop erase procedure and return the faulty address */
		*PageError = address;
		break;
	  }
	}
  }


  /* Process Unlocked */
  __HAL_UNLOCK(&pFlash);

  return status;
}

bool conf_general_erase_flash(uint32_t addr, uint32_t pages){

	HAL_FLASH_Unlock();

	uint32_t page_error = 0;
	FLASH_EraseInitTypeDef s_eraseinit;
	s_eraseinit.TypeErase   = FLASH_TYPEERASE_PAGES;
	s_eraseinit.PageAddress = addr;
	s_eraseinit.NbPages     = pages;
	HAL_FLASHEx_EraseGD(&s_eraseinit, &page_error);

	HAL_FLASH_Lock();

	return true;
}

bool conf_general_write_fl(uint32_t base, uint8_t * data, uint16_t size){
	uint32_t word;
	uint8_t byte=0;
	uint8_t * word_ptr = (uint8_t*)&word;
	uint32_t flash_incr=0;

